abstract final class ArabicLayout {
  static const List<List<String>> mainLayout = [
    ['ض', 'ص', 'ث', 'ق', 'ف', 'غ', 'ع', 'ه', 'خ', 'ح', 'ج'],
    ['ش', 'س', 'ي', 'ب', 'ل', 'ا', 'ت', 'ن', 'م', 'ك'],
    ['ئ', 'ء', 'ؤ', 'ر', 'لا', 'ى', 'ة', 'و', 'ز', 'ظ'],
  ];

  static const List<List<String>> shiftLayout = [
    ['َ', 'ً', 'ُ', 'ٌ', 'لإ', 'إ', '\'', '÷', '×', '؛', '<'],
    ['ِ', 'ٍ', ']', '[', 'لأ', 'أ', 'ـ', '،', '/', ':'],
    ['~', 'ْ', '}', '{', 'لآ', 'آ', '\'', ',', '.', '؟'],
  ];

  static const List<String> numberRow = [
    '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩', '٠',
  ];
}
